package com.xuzhipeng.superlib.module.college;

/**
 * Author: xuzhipeng
 * Email: langzi0418@gmail.com
 * Date: 2017/9/25
 * Desc:
 */

class CollegeData {
    static final String DATA
            = "[{\"name\":\"安徽\",\"type\":0},\n" +
            "{\"name\":\"中国科学技术大学\",\"base\":\"http://opac.lib.ustc.edu.cn/\",\"type\":1},\n" +
            "\n" +
            "{\"name\":\"北京\",\"type\":0},\n" +
            "{\"name\":\"北京国家会计学院\",\"base\":\"http://library.nai.edu.cn/\",\"type\":1},\n" +
            "{\"name\":\"北京协和医学院\",\"base\":\"http://opac.imicams.ac.cn:8090/\",\"type\":1},\n" +
            "{\"name\":\"中国农业大学\",\"base\":\"http://mylib.cau.edu.cn/\",\"type\":1},\n" +
            "{\"name\":\"中国石油大学(北京)\",\"base\":\"http://202.204.202.6/\",\"type\":1},\n" +
            "{\"name\":\"中央财经大学\",\"base\":\"http://202.205.213.113:8080/\",\"type\":1},\n" +
            "\n" +
            "{\"name\":\"福建\",\"type\":0},\n" +
            "{\"name\":\"福建农林大学\",\"base\":\"http://210.34.85.114:8080/\",\"type\":1},\n" +
            "{\"name\":\"福建师范大学\",\"base\":\"http://libopac.fjnu.edu.cn/\",\"type\":1},\n" +
            "\n" +
            "{\"name\":\"甘肃\",\"type\":0},\n" +
            "{\"name\":\"西北师范大学\",\"base\":\"http://lib.nwnu.edu.cn:8080/\",\"type\":1},\n" +
            "\n" +
            "{\"name\":\"广东\",\"type\":0},\n" +
            "{\"name\":\"华南农业大学\",\"base\":\"http://202.116.174.108:8080/\",\"type\":1},\n" +
            "\n" +
            "{\"name\":\"广西\",\"type\":0},\n" +
            "{\"name\":\"广西师范大学 \",\"base\":\"http://opac.gxnu.edu.cn/\",\"type\":1},\n" +
            "{\"name\":\"玉林师范学院\",\"base\":\"http://lib.ylu.edu.cn:8080/\",\"type\":1},\n" +
            "\n" +
            "{\"name\":\"海南\",\"type\":0},\n" +
            "{\"name\":\"海南师范大学\",\"base\":\"http://210.37.2.189/\",\"type\":1},\n" +
            "{\"name\":\"海南医学院 \",\"base\":\"http://210.37.79.9/\",\"type\":1},\n" +
            "{\"name\":\"琼台师范学院\",\"base\":\"http://222.17.192.82:8080/\",\"type\":1},\n" +
            "\n" +
            "{\"name\":\"河北\",\"type\":0},\n" +
            "{\"name\":\"华北理工大学\",\"base\":\"http://211.68.159.2:88/\",\"type\":1},\n" +
            "\n" +
            "{\"name\":\"黑龙江\",\"type\":0},\n" +
            "{\"name\":\"哈尔滨工程大学\",\"base\":\"http://202.118.176.18:8080/\",\"type\":1},\n" +
            "\n" +
            "{\"name\":\"湖北\",\"type\":0},\n" +
            "{\"name\":\"黄冈师范学院\",\"base\":\"http://211.69.154.180:8080/\",\"type\":1},\n" +
            "{\"name\":\"江汉大学\",\"base\":\"http://opac.lib.jhun.edu.cn:8080/\",\"type\":1},\n" +
            "{\"name\":\"武汉纺织大学\",\"base\":\"http://opac.wtu.edu.cn:8080/\",\"type\":1},\n" +
            "{\"name\":\"武汉工程大学\",\"base\":\"http://218.199.187.110/\",\"type\":1},\n" +
            "{\"name\":\"武汉科技大学\",\"base\":\"http://opac.lib.wust.edu.cn:8080/\",\"type\":1},\n" +
            "{\"name\":\"武汉轻工大学\",\"base\":\"http://opac.lib.whpu.edu.cn/\",\"type\":1},\n" +
            "{\"name\":\"襄阳职业技术学院\",\"base\":\"http://116.208.0.96:8080/\",\"type\":1},\n" +
            "\n" +
            "{\"name\":\"吉林\",\"type\":0},\n" +
            "{\"name\":\"北华大学\",\"base\":\"http://59.72.151.6:8080/\",\"type\":1},\n" +
            "{\"name\":\"长春理工大学\",\"base\":\"http://210.47.0.5:8080/\",\"type\":1},\n" +
            "{\"name\":\"吉林财经大学\",\"base\":\"http://221.8.30.170:8080/\",\"type\":1},\n" +
            "{\"name\":\"吉林省图书馆\",\"base\":\"http://218.62.1.221:8080/\",\"type\":1},\n" +
            "{\"name\":\"吉林师范大学\",\"base\":\"http://opac.jlnu.edu.cn:8080/\",\"type\":1},\n" +
            "{\"name\":\"延边大学\",\"base\":\"http://202.198.212.11:8080/\",\"type\":1},\n" +
            "\n" +
            "{\"name\":\"江苏\",\"type\":0},\n" +
            "{\"name\":\"东南大学\",\"base\":\"http://www.libopac.seu.edu.cn:8080/\",\"type\":1},\n" +
            "{\"name\":\"河海大学\",\"base\":\"http://202.119.113.175/\",\"type\":1},\n" +
            "{\"name\":\"金陵图书馆\",\"base\":\"http://opac.jllib.cn/\",\"type\":1},\n" +
            "{\"name\":\"南京工业大学\",\"base\":\"http://202.119.252.200:8080/\",\"type\":1},\n" +
            "{\"name\":\"南京理工大学\",\"base\":\"http://202.119.83.14:8080/uopac/\",\"type\":1},\n" +
            "{\"name\":\"南京林业大学\",\"base\":\"http://202.119.210.3:8080/\",\"type\":1},\n" +
            "{\"name\":\"扬州大学\",\"base\":\"http://opac.yzu.edu.cn:8080/\",\"type\":1},\n" +
            "\n" +
            "{\"name\":\"江西\",\"type\":0},\n" +
            "{\"name\":\"南昌大学\",\"base\":\"http://210.35.251.243/\",\"type\":1},\n" +
            "{\"name\":\"江西财经大学\",\"base\":\"http://210.35.206.99:8080/\",\"type\":1},\n" +
            "\n" +
            "{\"name\":\"辽宁\",\"type\":0},\n" +
            "{\"name\":\"渤海大学\",\"base\":\"http://210.47.177.84/\",\"type\":1},\n" +
            "{\"name\":\"大连工业大学 \",\"base\":\"http://219.216.175.5:8080/\",\"type\":1},\n" +
            "{\"name\":\"大连民族大学 \",\"base\":\"http://210.30.8.233:8080/\",\"type\":1},\n" +
            "{\"name\":\"辽宁工程技术大学\",\"base\":\"http://202.199.233.11:8080/\",\"type\":1},\n" +
            "{\"name\":\"辽宁石油化工大学\",\"base\":\"http://202.118.121.233:8080/\",\"type\":1},\n" +
            "{\"name\":\"沈阳工业大学\",\"base\":\"http://202.199.103.3:8080/\",\"type\":1},\n" +
            "{\"name\":\"沈阳师范大学\",\"base\":\"http://opac.synu.edu.cn:8080/opac/\",\"type\":1},\n" +
            "{\"name\":\"中国医科大学\",\"base\":\"http://202.118.40.70/\",\"type\":1},\n" +
            "\n" +
            "{\"name\":\"山东\",\"type\":0},\n" +
            "{\"name\":\"聊城大学\",\"base\":\"http://210.44.126.8:8080/\",\"type\":1},\n" +
            "{\"name\":\"齐鲁工业大学\",\"base\":\"http://121.250.34.12:8080/\",\"type\":1},\n" +
            "{\"name\":\"山东理工大学\",\"base\":\"http://222.206.65.12/\",\"type\":1},\n" +
            "{\"name\":\"山东农业大学\",\"base\":\"http://202.194.143.19/\",\"type\":1},\n" +
            "{\"name\":\"山东师范大学\",\"base\":\"http://210.44.1.6:8080/\",\"type\":1},\n" +
            "{\"name\":\"山东艺术学院\",\"base\":\"http://121.250.23.11:8080/\",\"type\":1},\n" +
            "{\"name\":\"枣庄学院\",\"base\":\"http://210.44.232.47:8080/\",\"type\":1},\n" +
            "\n" +
            "{\"name\":\"陕西\",\"type\":0},\n" +
            "{\"name\":\"西安工程大学\",\"base\":\"http://202.200.188.3:8080/\",\"type\":1},\n" +
            "\n" +
            "{\"name\":\"上海\",\"type\":0},\n" +
            "{\"name\":\"华东政法大学\",\"base\":\"http://lib.ecupl.edu.cn:8088/\",\"type\":1},\n" +
            "{\"name\":\"上海建桥学院\",\"base\":\"http://tsjs.gench.edu.cn:8080/\",\"type\":1},\n" +
            "{\"name\":\"上海中医药大学\",\"base\":\"http://lib.shutcm.edu.cn:8080/\",\"type\":1},\n" +
            "{\"name\":\"同济大学\",\"base\":\"http://webpac.lib.tongji.edu.cn/\",\"type\":1},\n" +
            "\n" +
            "{\"name\":\"四川\",\"type\":0},\n" +
            "{\"name\":\"成都信息工程大学\",\"base\":\"http://210.41.233.144:8080/\",\"type\":1},\n" +
            "{\"name\":\"西南科技大学\",\"base\":\"http://202.115.162.45:8080/\",\"type\":1},\n" +
            "\n" +
            "{\"name\":\"新疆\",\"type\":0},\n" +
            "{\"name\":\"石河子大学\",\"base\":\"http://202.201.163.20:8080/\",\"type\":1},\n" +
            "{\"name\":\"新疆大学\",\"base\":\"http://218.195.234.25:8080/\",\"type\":1},\n" +
            "\n" +
            "{\"name\":\"云南\",\"type\":0},\n" +
            "{\"name\":\"云南民族大学\",\"base\":\"http://202.203.145.96:8080/\",\"type\":1}]";
}
